# Функции - это команды языка, есть встроенные в язык, а есть функции
# написанные пользователем-программистом
# input() - считывает с клавиатуры одну строку
# print(а) - печатает на экран значение а и переход на новую строчку
print('adsf')
print() # вывод пустой строки
print('fdsa')

# int(а) - перевод значения переменной а в целое число
# float(а) - перевод значения переменной а в действительное число
# str(а) - перевод значения переменной а в строку
# abs(а) - модуль значения переменной а
# len(a) - функция которая считает длину строки хранящейся в переменной а
# выдает кол-во символов в строке

# !!! функции можно комбинировать
a = len(input())
print(abs(int(input())))